In [1]:
from mysql.connector import Error
import mysql.connector
import pandas as pd

In [2]:
def createServerConnection(hostName, userName, passWord):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=hostName, user=userName, passwd=passWord)
        print("MySQL Database Connected Successfully")
    except Error as err:
        print(f"Error : '{err}'")
    return connection


connection = createServerConnection("localhost", "root", "9531")

MySQL Database Connected Successfully

Check : Connected or Not

In [3]:
if connection.is_connected():
    print("Connected SussessFylly")
else:
    print("Not Connected")

Connected SussessFylly

Create Database

In [4]:
def createDatabase(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        cursor.close()
        print("Database Created Successfully")
    except Error as err:
        print(f"Error : '{err}'")


database1 = "Something"
createDatabaseQuery = f"create database if not exists {database1}"
createDatabase(connection, createDatabaseQuery)

Database Created Successfully

Connect To Database

In [5]:
def createDBConnection(hoshostName, userName, passWord, database):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=hoshostName, user=userName, passwd=passWord, database=database1)
        print(f"Connected To Database '{database1}' Successfully")
    except Error as err:
        print(f"Error : '{err}'")
    return connection

Use Database

In [6]:
# this Statement = "use database;" in SQL
connection = createDBConnection("localhost", "root", "9531", database1)

Connected To Database 'Something' Successfully

Execute SQL Queries

In [7]:
def executeQuery(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query Executed Successfully")
        print(f"{cursor.rowcount} Rows Affected")
        # lastrowid only work when auto increment key is present in table
        print(f"Last Row : {cursor.lastrowid}")
        cursor.close()
    except Error as err:
        # if any Error Occured During Commiting or Saving the Changes Then RollBack is called
        connection.rollback()
        print(f"Error : '{err}'")

Execute SQL Parameterized Queries For 1 Row Using Tuple

In [8]:
def executeParaQuery(connection, query, tpl):
    cursor = connection.cursor()
    try:
        cursor.execute(query, tpl)
        connection.commit()
        print("Query Executed Successfully")
        print(f"{cursor.rowcount} Rows Affected")
        # lastrowid only work when auto increment key is present in table
        print(f"Last Row : {cursor.lastrowid}")
        cursor.close()
    except Error as err:
        # if any Error Occured During Commiting or Saving the Changes Then RollBack is called
        connection.rollback()
        print(f"Error : '{err}'")

Execute SQL Parameterized Queries For Many Rows Using Tuple

In [9]:
def executeParaManyQuery(connection, query, lst):
    cursor = connection.cursor()
    try:
        cursor.executemany(query, lst)
        connection.commit()
        print("Query Executed Successfully")
        print(f"{cursor.rowcount} Rows Affected")
        # lastrowid only work when auto increment key is present in table
        print(f"Last Row : {cursor.lastrowid}")
        cursor.close()
    except Error as err:
        # if any Error Occured During Commiting or Saving the Changes Then RollBack is called
        connection.rollback()
        print(f"Error : '{err}'")

For Dictionary for 1 Row Using Dictionary

In [10]:
def executeParaDictQuery(connection, query, dct):
    cursor = connection.cursor()
    try:
        cursor.execute(query, dct)
        connection.commit()
        print("Query Executed Successfully")
        print(f"{cursor.rowcount} Rows Affected")
        # lastrowid only work when auto increment key is present in table
        print(f"Last Row : {cursor.lastrowid}")
        cursor.close()
    except Error as err:
        # if any Error Occured During Commiting or Saving the Changes Then RollBack is called
        connection.rollback()
        print(f"Error : '{err}'")

For Dictionary for Many Rows Using Dictionary

In [11]:
def executeParaDictManyQuery(connection, query, lstDict):
    cursor = connection.cursor()
    try:
        cursor.executemany(query, lstDict)
        connection.commit()
        print("Query Executed Successfully")
        print(f"{cursor.rowcount} Rows Affected")
        # lastrowid only work when auto increment key is present in table
        print(f"Last Row : {cursor.lastrowid}")
        cursor.close()
    except Error as err:
        # if any Error Occured During Commiting or Saving the Changes Then RollBack is called
        connection.rollback()
        print(f"Error : '{err}'")

In [12]:
createOrderTable = """
CREATE TABLE if not exists order_table(
    order_id int primary key auto_increment,
    customer_name varchar(30) not null,
    product_name varchar(20) not null,
    date_ordered date,
    quantity int,
    unit_price float,
    phone_no varchar(20)
);
"""
# connect to the database
executeQuery(connection, createOrderTable)

Query Executed Successfully
0 Rows Affected
Last Row : 0

Insert Data

In [13]:
dataOrders = """
insert  into order_table (customer_name, product_name, date_ordered, quantity, unit_price, phone_no) 
  values  
    ("Steve", "Laptop", "2018-06-12", 2, 800, "6293730802"),
    ("Joe", "Book", "2019-02-10", 10, 12, "5621478932"),
    ("Stacy", "Trouser", "2018-12-25", 5, 50, "9874521469"),
    ("Nancy", "T-Shirt", "2018-07-14", 7, 30, "1235412589"),
    ("Maria", "Headphones", "2019-05-30", 6, 48, "532147298"),
    ("Danny", "Smart Tv", "2018-08-20", 10, 300, "3541978265"),
    ("Kr. SOURAV", "I Phone", "2023-09-05", 1, 150000, "9877330880"),
    ("Varun", "MacBook", "2023-09-05", 1, 159999, "9658741236"),
    ("Keshav", "UnderWear", "2023-09-05", 5, 80, "5417426985"),
    ("Dinesh", "AirPods", "2023-09-05", 1, 60000, "8855214569"),
    ("JassPreet", "Moniter", "2023-09-05", 2, 45000, "7411474147");
"""
executeQuery(connection, dataOrders)

Query Executed Successfully
11 Rows Affected
Last Row : 210

Parameterized Query For 1 Row

In [14]:
# From Tuple
data = ("Sadhu", "Pot", "2022-07-12", 4, 50, "9999999999")
iq1 = """
insert into order_table (customer_name, product_name, date_ordered, quantity, unit_price, phone_no)
       values (%s, %s, %s, %s, %s, %s)
"""
executeParaQuery(connection, iq1, data)

Query Executed Successfully
1 Rows Affected
Last Row : 221

Parameterized Query For Many Rows

In [15]:
# From Tuple
manyData = [("Harry", "Pizza", "2022-05-01", 2, 100, "9541256951"),
        ("Chahal", "Burgger", "2022-07-02", 4, 60, "3571594562"),
        ("Manveer", "Jacket", "2022-07-06", 2, 2100, "7415987415")]
iq2 = """
insert into order_table (customer_name, product_name, date_ordered, quantity, unit_price, phone_no)
       values (%s, %s, %s, %s, %s, %s)
"""
executeParaManyQuery(connection, iq2, manyData)

Query Executed Successfully
3 Rows Affected
Last Row : 222

In [16]:
# From Dictionary For 1 Row
dataDict = {"cName": "Sameer", "pNmae": "A.C.", "date": "2022-01-04",
            "qty": 1, "uPrice": 90000, "phNo": "5214521452"}
iq3 = """
insert into order_table (customer_name, product_name, date_ordered, quantity, unit_price, phone_no)
       values (%(cName)s, %(pNmae)s, %(date)s, %(qty)s, %(uPrice)s, %(phNo)s);
"""
executeParaDictQuery(connection, iq3, dataDict)

Query Executed Successfully
1 Rows Affected
Last Row : 225

In [17]:
# From Dictionary For Many Rows
dataDictMany = [{"cName": "Muskaan", "pNmae": "I Phone", "date": "2022-09-05",
                 "qty": 1, "uPrice": 150000, "phNo": "9877330881"}, {"cName": "Pankaj", "pNmae": "Battery", "date": "2022-09-06",
                                                                     "qty": 2, "uPrice": 30, "phNo": "8888555544"}, {"cName": "Naazdeep", "pNmae": "Notebook", "date": "2022-09-06",
                                                                                                                     "qty": 7, "uPrice": 70, "phNo": "3211114569"}]
iq4 = """
insert into order_table (customer_name, product_name, date_ordered, quantity, unit_price, phone_no)
       values (%(cName)s, %(pNmae)s, %(date)s, %(qty)s, %(uPrice)s, %(phNo)s);
"""
executeParaDictManyQuery(connection, iq4, dataDictMany)

executeQuery(connection, "delete from order_table where order_id > 19")

Query Executed Successfully
3 Rows Affected
Last Row : 226
Query Executed Successfully
19 Rows Affected
Last Row : 0

Delete By Parameterized QueryRow Using Tuple

In [18]:
# From Tuple
dataD = ("Harry",)
dq1 = """
delete from order_table where customer_name = %s;
"""
executeParaQuery(connection, dq1, dataD)

Query Executed Successfully
0 Rows Affected
Last Row : 0

Delete By Parameterized Query Row Using Dictionary

In [19]:
dataDDict = {"cName": "joe"}
dq2 = """
delete from order_table where customer_name = %(cName)s;
"""
executeParaQuery(connection, dq2, dataDDict)

Query Executed Successfully
0 Rows Affected
Last Row : 0

Read From Database

In [20]:
def readQuery(connection, query):
    cursor = connection.cursor(buffered=True)
    result = None
    try:
        cursor.execute(query)
        # fetchone only give one row and it is iterable, required buffered=true or not close the cursor
        # result = cursor.fetchone()
        # fetchall give all rows and it returns list of tuples(rows)
        result = cursor.fetchall()
        # fetchmany takes argument size=number of rows to fetch
        # result = cursor.fetchmany(5), required buffered=true or not close the cursor
        cursor.close()
        print("Total Rows :", cursor.rowcount)
        return result
    except Error as err:
        print(f"Error : '{err}'")

Using Select Statement

In [21]:
q1 = """
select * from order_table;
"""
q2 = """
select customer_name, phone_no from order_table;
"""
q3 = """
select customer_name, phone_no, year(date_ordered) from order_table;
"""
q4 = """
select distinct year(date_ordered) from order_table;
"""
q5 = """
select * from order_table where product_name = "t-shirt";
"""
q6 = """
select * from order_table where date_ordered < "2018-12-31";
"""
q7 = """
select * from order_table where date_ordered > "2018-12-31";
"""
q8 = """
select * from order_table order by unit_price desc;
"""
q9 = """
show databases;
"""
q10 = """
select * from order_table where customer_name = "keshav";
"""
results = readQuery(connection, q1)  # return a list of tuples
for r in results:
    print(r)

Total Rows : 16
(1, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(3, 'Stacy', 'Trouser', datetime.date(2018, 12, 25), 5, 50.0, '9874521469')
(5, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '532147298')
(6, 'Danny', 'Smart Tv', datetime.date(2018, 8, 20), 10, 300.0, '3541978265')
(7, 'Kr. SOURAV', 'I Phone', datetime.date(2023, 9, 5), 1, 150000.0, '9877330880')
(8, 'VarunPreet', 'MacBook', datetime.date(2023, 9, 5), 1, 159999.0, '9658741236')
(9, 'Keshav Sharma', 'UnderWear', datetime.date(2023, 9, 5), 5, 390.0, '5417426985')
(10, 'Dinesh', 'AirPods', datetime.date(2023, 9, 5), 1, 60000.0, '8855214569')
(11, 'JassPreet', 'Moniter', datetime.date(2023, 9, 5), 2, 45000.0, '7411474147')
(12, 'Sadhu', 'Pot', datetime.date(2022, 7, 12), 4, 50.0, '9999999999')
(14, 'Chahal', 'Burgger', datetime.date(2022, 7, 2), 4, 60.0, '3571594562')
(15, 'Manveer', 'Jacket', datetime.date(2022, 7, 6), 2, 2100.0, '7415987415')
(16, 'Sameer', 'A.C.', datetime.date(2022, 1, 4), 1, 90000.0, '5214521452')
(17, 'Muskaan', 'I Phone', datetime.date(2022, 9, 5), 1, 150000.0, '9877330881')
(18, 'Pankaj', 'Battery', datetime.date(2022, 9, 6), 2, 30.0, '8888555544')
(19, 'Naazdeep', 'Notebook', datetime.date(2022, 9, 6), 7, 70.0, '3211114569')

Update Query

In [22]:
up1 = """
update order_table set unit_price = 79.99 where customer_name = "Keshav";
"""
executeQuery(connection, up1)

Query Executed Successfully
0 Rows Affected
Last Row : 0

Update By Parameterized Query Using Tuple

In [23]:
uDataT = (159999, "varunpreet", "varun")
up2 = """
update order_table set unit_price = %s, customer_name = %s where customer_name = %s
"""
# up2 = """
# update order_table set unit_price = ? where customer_name = ?;
# """  # ? will execute when Prepared=True in cursor
executeParaQuery(connection, up2, uDataT)

Query Executed Successfully
0 Rows Affected
Last Row : 0

Update By Parameterized Query Using Dictionary

In [24]:
uDataD = {"qty": 10, "cName": "danny"}
up3 = """
update order_table set quantity = %(qty)s where customer_name = %(cName)s
"""
executeParaQuery(connection, up3, uDataD)

Query Executed Successfully
0 Rows Affected
Last Row : 0

In [25]:
tableList = []
for i in results:
    tableList.append(i)
columns = ("Order_ID", "Customer_Name", "Product_Name",
           "Date_Ordered", "Quantity", "Unit_Price", "Phone_No.")
df = pd.DataFrame(tableList, columns=columns)
df

,Order_ID,Customer_Name,Product_Name,Date_Ordered,Quantity,Unit_Price,Phone_No.
0,1,Steve,Laptop,2018-06-12,2,800.0,6293730802
1,3,Stacy,Trouser,2018-12-25,5,50.0,9874521469
2,5,Maria,Headphones,2019-05-30,6,48.0,532147298
3,6,Danny,Smart Tv,2018-08-20,10,300.0,3541978265
4,7,Kr. SOURAV,I Phone,2023-09-05,1,150000.0,9877330880
5,8,VarunPreet,MacBook,2023-09-05,1,159999.0,9658741236
6,9,Keshav Sharma,UnderWear,2023-09-05,5,390.0,5417426985
7,10,Dinesh,AirPods,2023-09-05,1,60000.0,8855214569
8,11,JassPreet,Moniter,2023-09-05,2,45000.0,7411474147
9,12,Sadhu,Pot,2022-07-12,4,50.0,9999999999
10,14,Chahal,Burgger,2022-07-02,4,60.0,3571594562
11,15,Manveer,Jacket,2022-07-06,2,2100.0,7415987415
12,16,Sameer,A.C.,2022-01-04,1,90000.0,5214521452
13,17,Muskaan,I Phone,2022-09-05,1,150000.0,9877330881
14,18,Pankaj,Battery,2022-09-06,2,30.0,8888555544
15,19,Naazdeep,Notebook,2022-09-06,7,70.0,3211114569

Update Commands

In [26]:
updateQuery = """
update order_table
set unit_price = 45 where order_id = 103;
"""
executeQuery(connection, updateQuery)

Query Executed Successfully
0 Rows Affected
Last Row : 0

In [27]:
results = readQuery(connection, q1)  # return a list of tuples
df = pd.DataFrame(results, columns=columns)
df

Total Rows : 16

,Order_ID,Customer_Name,Product_Name,Date_Ordered,Quantity,Unit_Price,Phone_No.
0,1,Steve,Laptop,2018-06-12,2,800.0,6293730802
1,3,Stacy,Trouser,2018-12-25,5,50.0,9874521469
2,5,Maria,Headphones,2019-05-30,6,48.0,532147298
3,6,Danny,Smart Tv,2018-08-20,10,300.0,3541978265
4,7,Kr. SOURAV,I Phone,2023-09-05,1,150000.0,9877330880
5,8,VarunPreet,MacBook,2023-09-05,1,159999.0,9658741236
6,9,Keshav Sharma,UnderWear,2023-09-05,5,390.0,5417426985
7,10,Dinesh,AirPods,2023-09-05,1,60000.0,8855214569
8,11,JassPreet,Moniter,2023-09-05,2,45000.0,7411474147
9,12,Sadhu,Pot,2022-07-12,4,50.0,9999999999
10,14,Chahal,Burgger,2022-07-02,4,60.0,3571594562
11,15,Manveer,Jacket,2022-07-06,2,2100.0,7415987415
12,16,Sameer,A.C.,2022-01-04,1,90000.0,5214521452
13,17,Muskaan,I Phone,2022-09-05,1,150000.0,9877330881
14,18,Pankaj,Battery,2022-09-06,2,30.0,8888555544
15,19,Naazdeep,Notebook,2022-09-06,7,70.0,3211114569

Delete Command

In [28]:
deleteOrderQuery = """
delete from order_table where product_name = "t-shirt";
"""
executeQuery(connection, deleteOrderQuery)

Query Executed Successfully
0 Rows Affected
Last Row : 0

In [29]:
results = readQuery(connection, q1)  # return a list of tuples
df = pd.DataFrame(results, columns=columns)
df

Total Rows : 16

,Order_ID,Customer_Name,Product_Name,Date_Ordered,Quantity,Unit_Price,Phone_No.
0,1,Steve,Laptop,2018-06-12,2,800.0,6293730802
1,3,Stacy,Trouser,2018-12-25,5,50.0,9874521469
2,5,Maria,Headphones,2019-05-30,6,48.0,532147298
3,6,Danny,Smart Tv,2018-08-20,10,300.0,3541978265
4,7,Kr. SOURAV,I Phone,2023-09-05,1,150000.0,9877330880
5,8,VarunPreet,MacBook,2023-09-05,1,159999.0,9658741236
6,9,Keshav Sharma,UnderWear,2023-09-05,5,390.0,5417426985
7,10,Dinesh,AirPods,2023-09-05,1,60000.0,8855214569
8,11,JassPreet,Moniter,2023-09-05,2,45000.0,7411474147
9,12,Sadhu,Pot,2022-07-12,4,50.0,9999999999
10,14,Chahal,Burgger,2022-07-02,4,60.0,3571594562
11,15,Manveer,Jacket,2022-07-06,2,2100.0,7415987415
12,16,Sameer,A.C.,2022-01-04,1,90000.0,5214521452
13,17,Muskaan,I Phone,2022-09-05,1,150000.0,9877330881
14,18,Pankaj,Battery,2022-09-06,2,30.0,8888555544
15,19,Naazdeep,Notebook,2022-09-06,7,70.0,3211114569

Closing The Connection

In [30]:
connection.close()

In [31]:
# executeQuery(connection, "drop table order_table;")

In [32]:
if connection.is_connected():
    print("Yes, Connected")
else:
    print("Not Connected")

Not Connected

# End